Revit 2024 API
BuiltInFailures.PlanRegionFailures.InvalidPlanRegionError Property
 Plan region is invalid. The sketch of a plan region may not contain intersecting, overlapping or nested loops.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId InvalidPlanRegionError { get; }
Visual Basic
Public Shared ReadOnly Property InvalidPlanRegionError As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ InvalidPlanRegionError {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.PlanRegionFailures Class
Autodesk.Revit.DB Namespace